<?php declare(strict_types=1);

use App\Ship\Enums\ContainerAliasEnum;

return [
    ContainerAliasEnum::LL_POST->value => [
        /*
        |--------------------------------------------------------------------------
        | Допустимые MIME-типы
        |--------------------------------------------------------------------------
        |
        | Список MIME-типов, которые разрешено загружать в контейнере Attachment.
        | Это могут быть изображения, документы, видео, аудио и т.д.
        |
        */
        'allowed_mimes' => [
            'image/jpeg',
            'image/png',
            'image/gif',
            'video/mp4',
        ],

        /*
        |--------------------------------------------------------------------------
        | Максимальный размер файла
        |--------------------------------------------------------------------------
        |
        | Размер указывается в килобайтах (10240 = 10 МБ)
        |
        */
        'max_file_size' => 10240,

        /*
        |--------------------------------------------------------------------------
        | Папка хранения файлов
        |--------------------------------------------------------------------------
        |
        | Путь относительно storage/app/public
        |
        */
        'storage_path' => 'attachments'
    ]
];
