<?php declare(strict_types=1);

return [
    'default' => [
        /*
        |--------------------------------------------------------------------------
        | Допустимые MIME-типы
        |--------------------------------------------------------------------------
        |
        | Список MIME-типов, которые разрешено загружать в контейнере Image.
        |
        */
        'allowed_mimes' => [
            'image/jpeg',
            'image/png',
            'image/gif',
            'image/svg'
        ],

        /*
        |--------------------------------------------------------------------------
        | Максимальный размер файла
        |--------------------------------------------------------------------------
        |
        | Размер указывается в килобайтах (10240 = 10 МБ)
        |
        */
        'max_file_size' => 15360,

        /*
        |--------------------------------------------------------------------------
        | Маска хранения файлов
        |--------------------------------------------------------------------------
        |
        | Путь относительно storage/app/public
        |
        */
        'mask' => [
            'base' => 'userfiles/{user_id}/images/{album_id}/{file_id}.{ext}',
            'list_thumb' => 'userfiles/{user_id}/images/{album_id}/thumbnails/{file_id}_list_thumbnail.{ext}',
            'preview_thumb' => 'userfiles/{user_id}/images/{album_id}/thumbnails/{file_id}_preview_thumbnail.{ext}',
        ]
    ]
];
