<?php declare(strict_types=1);

return [
    'default' => [
        /*
        |--------------------------------------------------------------------------
        | Допустимые MIME-типы
        |--------------------------------------------------------------------------
        |
        | Список MIME-типов, которые разрешено загружать в контейнере Image.
        |
        */
        'allowed_mimes' => [
            'video/mp4',
            'video/avi',
            'video/mov',
            'video/mkv',
            'video/3gp'
        ],

        /*
        |--------------------------------------------------------------------------
        | Максимальный размер файла
        |--------------------------------------------------------------------------
        |
        | Размер указывается в килобайтах (10240 = 10 МБ)
        |
        */
        'max_file_size' => 51200,

        /*
        |--------------------------------------------------------------------------
        | Маска хранения файлов
        |--------------------------------------------------------------------------
        |
        | Путь относительно storage/app/public
        |
        */
        'mask' => [
            'base' => 'userfiles/{user_id}/videos/{album_id}/{file_id}.{ext}',
            'list_thumb' => 'userfiles/{user_id}/videos/{album_id}/thumbnails/{file_id}_list_thumbnail.{ext}'
        ]
    ]
];
